podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/USART_LPC11Uxx.svd.xml
            <register>
               <name>MSR</name>
               <description>Modem Status Register</description>
               <addressOffset>0x18</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DCTS</name>
                     <description>Delta CTS. Set upon state change of input CTS. Cleared on an MSR read</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE_DETECTED_O</name>
                           <description>No change detected on modem input, CTS</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STATE_CHANGE_DETECTE</name>
                           <description>State change detected on modem input, CTS</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DDSR</name>
                     <description>Delta DSR. Set upon state change of input DSR. Cleared on an MSR read</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE_DETECTED_O</name>
                           <description>No change detected on modem input, DSR</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STATE_CHANGE_DETECTE</name>
                           <description>State change detected on modem input, DSR</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TERI</name>
                     <description>Trailing Edge RI. Set upon low to high transition of input RI. Cleared on an MSR read</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE_DETECTED_O</name>
                           <description>No change detected on modem input, RI</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW_TO_HIGH_TRANSITI</name>
                           <description>Low-to-high transition detected on RI</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DDCD</name>
                     <description>Delta DCD. Set upon state change of input DCD. Cleared on an MSR read</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_CHANGE_DETECTED_O</name>
                           <description>No change detected on modem input, DCD</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STATE_CHANGE_DETECTE</name>
                           <description>State change detected on modem input, DCD</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CTS</name>
                     <description>Clear To Send State. Complement of input signal CTS. This bit is connected to MCR[1] in modem loopback mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSR</name>
                     <description>Data Set Ready State. Complement of input signal DSR. This bit is connected to MCR[0] in modem loopback mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RI</name>
                     <description>Ring Indicator State. Complement of input RI. This bit is connected to MCR[2] in modem loopback mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCD</name>
                     <description>Data Carrier Detect State. Complement of input DCD. This bit is connected to MCR[3] in modem loopback mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCR</name>
               <description>Scratch Pad Register. Eight-bit temporary storage for software</description>
               <addressOffset>0x1C</addressOffset>
               <fields>
                  <field>
                     <name>PAD</name>
                     <description>A readable, writable byte</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACR</name>
               <description>Auto-baud Control Register. Contains controls for the auto-baud feature</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>START</name>
                     <description>This bit is automatically cleared after auto-baud completion</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>AUTO_BAUD_STOP_AUTO</name>
                           <description>Auto-baud stop (auto-baud is not running)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AUTO_BAUD_START_AUT</name>
                           <description>Auto-baud start (auto-baud is running). Auto-baud run bit. This bit is automatically cleared after auto-baud completion</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Auto-baud mode select bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>MODE_0_</name>
                           <description>Mode 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODE_1_</name>
                           <description>Mode 1</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AUTORESTART</name>
                     <description>Start mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_RESTART</name>
                           <description>No restart</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESTART_IN_CASE_OF_T</name>
                           <description>Restart in case of time-out (counter restarts at next USART Rx falling edge)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ABEOINTCLR</name>
                     <description>End of auto-baud interrupt clear bit (write only accessible)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_IMPACT</name>
                           <description>Writing a 0 has no impact</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR</name>
                           <description>Writing a 1 will clear the corresponding interrupt in the IIR</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ABEOINTCLR" > <name>ABTOINTCLR</name> <description>Auto-baud time-out interrupt clear bit (write only accessible)</description> <bitOffset>9</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>ICR</name>
               <description>IrDA Control Register. Enables and configures the IrDA (remote control) mode</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>IRDAEN</name>
                     <description>IrDA mode enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IRDA_MODE_IS_DISABLE</name>
                           <description>IrDA mode is disabled, USARTn acts as a standard USART</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IRDA_MODE_IS_ENABLED</name>
                           <description>IrDA mode is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRDAINV</name>
                     <description>Serial input inverter</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INVERTED</name>
                           <description>The serial input is not inverted</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_INVERTED</name>
                           <description>The serial input is inverted. This has no effect on the serial output</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FIXPULSEEN</name>
                     <description>IrDA fixed pulse width mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>IrDA fixed pulse width mode disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>IrDA fixed pulse width mode enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PULSEDIV</name>
                     <description>Configures the pulse width when FixPulseEn = 1</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>3_DIV_16_X_BAUD_RATE</name>
                           <description>3 / (16 x baud rate)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2_X_TPCLK</name>
                           <description>2 x TPCLK</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4_X_TPCLK</name>
                           <description>4 x TPCLK</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8_X_TPCLK</name>
                           <description>8 x TPCLK</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16_X_TPCLK</name>
                           <description>16 x TPCLK</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32_X_TPCLK</name>
                           <description>32 x TPCLK</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>64_X_TPCLK</name>
                           <description>64 x TPCLK</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>128_X_TPCLK</name>
                           <description>128 x TPCLK</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FDR</name>
               <description>Fractional Divider Register. Generates a clock input for the baud rate divider</description>
               <addressOffset>0x28</addressOffset>
               <resetValue>0x10</resetValue>
               <fields>
                  <field>
                     <name>DIVADDVAL</name>
                     <description>Baud rate generation pre-scaler divisor value. If this field is 0, fractional baud rate generator will not impact the USART baud rate</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MULVAL</name>
                     <description>Baud rate pre-scaler multiplier value. This field must be greater or equal 1 for USART to operate properly, regardless of whether the fractional baud rate generator is used or not</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSR</name>
               <description>Oversampling Register. Controls the degree of oversampling during each bit time</description>
               <addressOffset>0x2C</addressOffset>
               <resetValue>0xF0</resetValue>
               <fields>
                  <field>
                     <name>OSFRAC</name>
                     <description>Fractional part of the oversampling ratio, in units of 1/8th of an input clock period. (001 = 0.125, ..., 111 = 0.875)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>OSINT</name>
                     <description>Integer part of the oversampling ratio, minus 1. The reset values equate to the normal operating mode of 16 input clocks per bit time</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FDINT</name>
                     <description>In Smart Card mode, these bits act as a more-significant extension of the OSint field, allowing an oversampling ratio up to 2048 as required by ISO7816-3. In Smart Card mode, bits 14:4 should initially be set to 371, yielding an oversampling ratio of 372</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TER</name>
               <description>Transmit Enable Register. Turns off USART transmitter for use with software flow control</description>
               <addressOffset>0x30</addressOffset>
               <resetValue>0x80</resetValue>
               <fields>
                  <field>
                     <name>TXEN</name>
                     <description>When this bit is 1, as it is after a Reset, data written to the THR is output on the TXD pin as soon as any preceding data has been sent. If this bit cleared to 0 while a character is being sent, the transmission of that character is completed, but no further characters are sent until this bit is set again. In other words, a 0 in this bit blocks the transfer of characters from the THR or TX FIFO into the transmit shift register. Software can clear this bit when it detects that the a hardware-handshaking TX-permit signal (CTS) has gone false, or with software handshaking, when it receives an XOFF character (DC3). Software can set this bit again when it detects that the TX-permit signal has gone true, or when it receives an XON (DC1) character</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HDEN</name>
               <description>Half duplex enable register</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>HDEN</name>
                     <description>Half-duplex mode enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_HALF_DUPLEX_</name>
                           <description>Disable half-duplex mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_HALF_DUPLEX_M</name>
                           <description>Enable half-duplex mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
