podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/USART_LPC11Uxx.svd.xml
            <register>
               <name>SCICTRL</name>
               <description>Smart Card Interface Control register. Enables and configures the Smart Card Interface feature</description>
               <addressOffset>0x48</addressOffset>
               <fields>
                  <field>
                     <name>SCIEN</name>
                     <description>Smart Card Interface Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SMART_CARD_INTERFACE</name>
                           <description>Smart card interface disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNCHRONOUS_HALF_DU</name>
                           <description>Asynchronous half duplex smart card interface is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NACKDIS</name>
                     <description>NACK response disable. Only applicable in T=0</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>A NACK response is enabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>A NACK response is inhibited</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PROTSEL</name>
                     <description>Protocol selection as defined in the ISO7816-3 standard</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>T_EQ_0</name>
                           <description>T = 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>T_EQ_1</name>
                           <description>T = 1</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXRETRY</name>
                     <description>When the protocol selection T bit (above) is 0, the field controls the maximum number of retransmissions that the USART will attempt if the remote device signals NACK. When NACK has occurred this number of times plus one, the Tx Error bit in the LSR is set, an interrupt is requested if enabled, and the USART is locked until the FIFO is cleared</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>XTRAGUARD</name>
                     <description>When the protocol selection T bit (above) is 0, this field indicates the number of bit times (ETUs) by which the guard time after a character transmitted by the USART should exceed the nominal 2 bit times. 0xFF in this field may indicate that there is just a single bit after a character and 11 bit times/character</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RS485CTRL</name>
               <description>RS-485/EIA-485 Control. Contains controls to configure various aspects of RS-485/EIA-485 modes</description>
               <addressOffset>0x4C</addressOffset>
               <fields>
                  <field>
                     <name>NMMEN</name>
                     <description>NMM enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>RS-485/EIA-485 Normal Multidrop Mode (NMM) is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>RS-485/EIA-485 Normal Multidrop Mode (NMM) is enabled. In this mode, an address is detected when a received byte causes the USART to set the parity error and generate an interrupt</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXDIS</name>
                     <description>Receiver enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>THE_RECEIVER_IS_ENAB</name>
                           <description>The receiver is enabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THE_RECEIVER_IS_DISA</name>
                           <description>The receiver is disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AADEN</name>
                     <description>AAD enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>AUTO_ADDRESS_DETECT_</name>
                           <description>Auto Address Detect (AAD) is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AUTO_ADDRESS_DETECT_</name>
                           <description>Auto Address Detect (AAD) is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SEL</name>
                     <description>Select direction control pin</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RTS</name>
                           <description>If direction control is enabled (bit DCTRL = 1), pin RTS is used for direction control</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DTR</name>
                           <description>If direction control is enabled (bit DCTRL = 1), pin DTR is used for direction control</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DCTRL</name>
                     <description>Auto direction control enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLE_AUTO_DIRECTI</name>
                           <description>Disable Auto Direction Control</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_AUTO_DIRECTIO</name>
                           <description>Enable Auto Direction Control</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OINV</name>
                     <description>Polarity control. This bit reverses the polarity of the direction control signal on the RTS (or DTR) pin</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>The direction control pin will be driven to logic 0 when the transmitter has data to be sent. It will be driven to logic 1 after the last bit of data has been transmitted</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>The direction control pin will be driven to logic 1 when the transmitter has data to be sent. It will be driven to logic 0 after the last bit of data has been transmitted</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RS485ADRMATCH</name>
               <description>RS-485/EIA-485 address match. Contains the address match value for RS-485/EIA-485 mode</description>
               <addressOffset>0x50</addressOffset>
               <fields>
                  <field>
                     <name>ADRMATCH</name>
                     <description>Contains the address match value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RS485DLY</name>
               <description>RS-485/EIA-485 direction control delay</description>
               <addressOffset>0x54</addressOffset>
               <fields>
                  <field>
                     <name>DLY</name>
                     <description>Contains the direction control (RTS or DTR) delay value. This register works in conjunction with an 8-bit counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNCCTRL</name>
               <description>Synchronous mode control register</description>
               <addressOffset>0x58</addressOffset>
               <fields>
                  <field>
                     <name>SYNC</name>
                     <description>Enables synchronous mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CSRC</name>
                     <description>Clock source select</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SYNCHRONOUS_SLAVE_MO</name>
                           <description>Synchronous slave mode (SCLK in)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYNCHRONOUS_MASTER_M</name>
                           <description>Synchronous master mode (SCLK out)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FES</name>
                     <description>Falling edge sampling</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RISING</name>
                           <description>RxD is sampled on the rising edge of SCLK</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLING</name>
                           <description>RxD is sampled on the falling edge of SCLK</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TSBYPASS</name>
                     <description>Transmit synchronization bypass in synchronous slave mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>The input clock is synchronized prior to being used in clock edge detection logic</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOSYNC</name>
                           <description>The input clock is not synchronized prior to being used in clock edge detection logic. This allows for a high er input clock rate at the expense of potential metastability</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CSCEN</name>
                     <description>Continuous master clock enable (used only when CSRC is 1)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SCLK_CYCLES_ONLY_WHE</name>
                           <description>SCLK cycles only when characters are being sent on TxD</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCLK_RUNS_CONTINUOUS</name>
                           <description>SCLK runs continuously (characters can be received on RxD independently from transmission on TxD)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SSDIS</name>
                     <description>Start/stop bits</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SEND_START_AND_STOP_</name>
                           <description>Send start and stop bits as in other modes</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DO_NOT_SEND_STARTSTOP</name>
                           <description>Do not send start/stop bits</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CCCLR</name>
                     <description>Continuous clock clear</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CSCEN_IS_UNDER_SOFTW</name>
                           <description>CSCEN is under software control</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HARDWARE_CLEARS_CSCE</name>
                           <description>Hardware clears CSCEN after each character is received</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
